'''''
Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх водин рядок через кому.
 Отримайте для масиву середнє арифметичне
Гармідер Анастасія 122В
'''''
import numpy as np#импортируем библиотеку нампи
b=np.zeros(5,dtype=int)#инициализируем масив нулями и присваеиваем типу данных тип данных инт
u=[]
for i in range(5):#проходимся по елементам масива
      b[i] = int(input('Введите ваши элементы: '))
for k in range(5):#снова проходимся по нашей масиву
      l=b[k]#помещаем элементы в пустую переменную
      u.append(l)#добавляем в список
g=sum(u)/5#ищем среднее арифметическое
print('Среднее арифитическое',g)
