'''''
Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть накран значення коріння і квадратів кожного з елементів масиву.
Гармідер Анастасія 122В
'''''
import numpy as np#импортируем библиотеку нампи
b=np.zeros(5,dtype=int)#инициализируем матрицу нулями и присваеиваем типу данных тип данных инт
u=[]
u1=[]
for i in range(5):#проходимся по елементам матрицы
      b[i] = int(input('Введите ваши элементы: '))#
for k in range(5):#снова проходимся по нашей матрице
      l=b[k]**2 # подносим к квадрату
      l1=b[k]**0.5 #корень
      u.append(l)#добавляем в список квадрат
      u1.append(l1)# добавляем в список корень
print('Значения в квадрате',u)
print('Корень',u1)