'''
Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву
здійснити випадковими числами від 150 до 300.
Гармідер Анастасія 122В
'''
import numpy as np#импортируем библиотеку нампи
import random
u=[]
c=0
b=np.zeros(20,dtype=int)#инициализируем матрицу масив и присваеиваем типу данных тип данных инт
for i in range(20):#проходимся по елементам масива
      b[i] = random.randint(150,300)#генерируем значения
s=np.mean(b) #ищем среднее арифметическое
for k in range(20):#снова проходимся
    l=b[k]#помещаем элементы в пустую переменную
    if l<s:
          c+=l
print('Среднее арифметическое',s)
print('Сумма всех элементов',c)