'''
Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у
масив T.
Гармідер Анастасія 122в
'''
a=999
T=-272
c=0
for i in range(6):#діапазон
    T=int(input())
    if T<a:
        a=T#на миниммальну температуру
    if T>T:
        T=T#на максимальну температуру
    c=T+c#сума яка ділиться на 6 (рекурсивно)
print('Мінімальна температура:', a)
print('Максимальна температура:',T)
print('Середня температура:',c/6)
