'''
Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
Гармідер Анастасія 122В
'''
import numpy as np#импортируем библиотеку нампи
import random
c = 0
s = 0
b=np.zeros(12,dtype=int)#инициализируем масив нулями и присваеиваем типу данных тип данных инт
for i in range(12):#проходимся по елементам матрицы
      b[i] = random.randint(10,100)
m=min(b)#Ищем минимальное значение
for k in range(12):
        s+=b[k]#ищем общее число осадков
        if b[k]<30:#если элемент меньше 30,месяц засушливый
            c+=1
print('Общее количество осадков',s)
print('Среднемесячное количество осадков',s/12)
print('Количество засушливых месяцев',c)
print('Количество осадков в самый засушливый месяц',m)