'''
Дано два лінійних масиву однакової розмірності. Скласти третій масив з
добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
Гармідер Анастасія 122В
'''
a=[1,1,2,3,5]#2 масива
b=[1,1,2,6,24]
f=list()
for c in range(len(a)):#діапазон
    f.append(a[c]*b[c])#помножемо по індексам
print('Третій масив:',f)