'''
Дані про температуру повітря і кількості опадів за декаду квітня
зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
вигляді снігу за цю декаду.
Гармідер Анастасія 122В
'''
c=0
e=0
for i in range(10):#діапазон
    b=int(input('Введіть температуру'))
    n=int(input('Введиіть кількість осадків'))
    if b<0:
        c=n+c#якщо температура ниже 0 то буде сніг
    else:
        e=n+e#якщо вище то дощь
print('Стільки днів йшов дождь',e )
print('Стільки днів йшов сніг:',c)

