'''''
Створіть масив А [1..7] за допомогою генератора випадкових чисел і виведіть його на екран. 
Збільште всі його елементи в 2 рази.
Гармідер Анастасія 122В
'''''
import numpy as np#импортируем библиотеку нампи
import random
u=[]
b=np.zeros(7,dtype=int)#инициализируем масив нулями и присваеиваем типу данных тип данных инт
for i in range(7):#проходимся по елементам матрицы
      b[i] = random.randint(0,100)
for k in range(7):#снова проходимся по нашей матрице
      l=b[k]*2#помещаем элементы в пустую переменную и умножаем на 2
      u.append(l)#добавляем в список
print(u)
