'''''
З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
що протягом цього часу температура знижувалася. Визначте, о котрій годині було
вперше зафіксовано від'ємну температуру.
Гармідер Анастасія 122В
'''''
import numpy as np#импортируем библиотеку нампи
import random
u=[]
a=np.array(range(8,21))#Инициализируем масиов,от 8 до 20
b=np.zeros(len(a),dtype=int)#инициализируем масив нулями  и присваиваем типу данных тип данных инт
for i in range(len(a)):#проходимся по елементам матрицы
      b[i] = random.randint(-20,10)
for k in range(len(a)):#снова проходимся
       if b[k]<0: #если цикл находит первый отрицательный элемент,то выводит температуру,индекс числа +8 часов
           print('Темепература снизилась меньше нуля впервые в',k+8,'часов')
           break